#เรียงสมากชิกจากหลังสุดไปหน้าสุด
a=[1,2,3,4,5,6,7,8,9,10]
print(a)
z=a[:-1] #-9 - ก่อน -1
y=a[:-5:1] #0 - ก่อน -5
q=a[:-5:-1]
s=a[2::-1]
x=a[2:8:-1]#step เป็นลบ จะวิ่ง ถอยหลัง และเงื่อนไขคือดัชนีต้อง มากกว่า stop
#ที่นี่ start=2, stop=8, step=-1 แต่เริ่มที่ดัชนี 2 ซึ่ง ไม่มากกว่า 8 ทำให้สไลซ์หยุดทันที → ได้ []
n=a[10:1]
b=a[-7::1]
c=a[::-2]
d=a[::-3]
e=a[::-4]
f=a[::]
g=a[2:7:1]#ตำแหน่งที่ 2 จนถึง 7 เพิ่มที่ละ1
h=a[:7:2]
i=a[1:-4:2]
j=a[:3:]
print("z",z)
print("y",y)
print("q",q)
print("s",s)
print("x",x)
print("n",n)
print("b",b)
print("c",c)
print("d",d)
print("e",e)
print("f",f)
print("g",g)
print("h",h)
print("i",i)
print("j",j)
#สรุป
# [start:stop:step]